Subset:

In [1]:
import pandas as pd

titanic = pd.read_csv("../data/titanic.csv")
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [3]:
ages = titanic["Age"]
ages.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [4]:
type(titanic["Age"])

pandas.core.series.Series

In [6]:
titanic["Age"].shape

(887,)

In [8]:
age_sex = titanic[["Age", "Sex"]]
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [9]:
titanic[["Age", "Sex"]].shape

(887, 2)

Filter Rows:

In [11]:
above_35 = titanic[titanic["Age"] > 35]
above_35.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
6,0,1,Mr. Timothy J McCarthy,male,54.0,0,0,51.8625
11,1,1,Miss. Elizabeth Bonnell,female,58.0,0,0,26.5500
13,0,3,Mr. Anders Johan Andersson,male,39.0,1,5,31.2750
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000

In [12]:
above_35.shape

(262, 8)

In [15]:
class_2Or3 = titanic[(titanic["Pclass"] == 2) | (titanic["Pclass"] == 3)] #passenger data for which the Pclass is 2 or 3.
class_2Or3.shape

(671, 8)

In [16]:
class_2Or3.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500
5,0,3,Mr. James Moran,male,27.0,0,0,8.4583
7,0,3,Master. Gosta Leonard Palsson,male,2.0,3,1,21.0750

In [18]:
ages_Not_NA = titanic[titanic["Age"].notna()]  # passenger data for which the age is known.
ages_Not_NA.shape

(887, 8)

In [20]:
adult_names = titanic.loc[titanic["Age"] > 35, "Name"] # names of the passengers older than 35 years.
adult_names.shape
adult_names.head()

1     Mrs. John Bradley (Florence Briggs Thayer) Cum...
6                                Mr. Timothy J McCarthy
11                              Miss. Elizabeth Bonnell
13                           Mr. Anders Johan Andersson
15                       Mrs. (Mary D Kingcome) Hewlett
Name: Name, dtype: object

In this case, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. The loc/iloc operators are required in front of the selection brackets []. When using loc/iloc, the part before the comma is the rows you want, and the part after the comma is the columns you want to select.

In [21]:
titanic.iloc[9: 25, 2 : 5] # rows 10 till 25 and columns 3 to 5.

                                                 Name     Sex   Age
9                  Mrs. Nicholas (Adele Achem) Nasser  female  14.0
10                     Miss. Marguerite Rut Sandstrom  female   4.0
11                            Miss. Elizabeth Bonnell  female  58.0
12                      Mr. William Henry Saundercock    male  20.0
13                         Mr. Anders Johan Andersson    male  39.0
14                Miss. Hulda Amanda Adolfina Vestrom  female  14.0
15                     Mrs. (Mary D Kingcome) Hewlett  female  55.0
16                                Master. Eugene Rice    male   2.0
17                        Mr. Charles Eugene Williams    male  23.0
18  Mrs. Julius (Emelia Maria Vandemoortele) Vande...  female  31.0
19                             Mrs. Fatima Masselmani  female  22.0
20                                Mr. Joseph J Fynney    male  35.0
21                               Mr. Lawrence Beesley    male  34.0
22                                 Miss. Anna McGowan  female  15.0
23                        Mr. William Thompson Sloper    male  28.0
24                       Miss. Torborg Danira Palsson  female   8.0

Again, a subset of both rows and columns is made in one go and just using selection brackets [] is not sufficient anymore. When specifically interested in certain rows and/or columns based on their position in the table, use the iloc operator in front of the selection brackets [].

In [22]:
titanic.iloc[0:3, 3] = "anonymous"
titanic.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,anonymous,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,anonymous,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,anonymous,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

When selecting specific rows and/or columns with loc or iloc, new values can be assigned to the selected data. For example, to assign the name anonymous to the first 3 elements of the third column